using System;

namespace W6_T3_Student
{
    /*
     Работа Долгова Константина

    Вебинар 6. Задача 3.
    Переделать программу Пример использования коллекций для решения следующих задач:
    а) Подсчитать количество студентов учащихся на 5 и 6 курсах;
    б) подсчитать сколько студентов в возрасте от 18 до 20 лет на каком курсе учатся (*частотный массив);
    в) отсортировать список по возрасту студента;
    г) *отсортировать список по курсу и возрасту студента;
     */
    class Program
    {
        static void Main(string[] args)
        {
            WorkFile.StartDemo(WorkFile.Data("students.txt"));
        }
    }
}
